Comment: Set ARCHITECTURE "x64" to download the Intel or "aarch64" for Apple Silicon.
Description: Downloads the latest OpenJDK for macOS.
Identifier: com.github.jakeshotrosky.download.OpenJDK
MinimumVersion: 2.3.0

Input:
  NAME: OpenJDK
  ARCHITECTURE: x64

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '<h1 class=\"gap\">Ready for use: <a href=\"/(\d*)/\">JDK \d*</a>'
    url: https://jdk.java.net

- Processor: URLTextSearcher
  Arguments:
    re_pattern: (?P<url>https://download.java.net/java/GA/jdk%match%.*?/GPL/openjdk-%match%.*?_macos-%ARCHITECTURE%_bin\.tar\.gz)
    url: https://jdk.java.net/%match%/index.html

- Processor: URLDownloader
  Arguments:
    url: '%url%'

- Processor: EndOfCheckPhase

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/Scripts'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Library: '0755'
      Library/Java: '0755'
      Library/Java/JavaVirtualMachines: '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%pkgroot%/Library/Java/JavaVirtualMachines'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%destination_path%/jdk*/'
    requirement: identifier "net.java.openjdk.jdk" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VB5E2TV963
