Description: Downloads the latest RStudio application.
Identifier: com.github.jakeshotrosky.download.RStudio
MinimumVersion: 2.3.0

Input:
  NAME: RStudio

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: (?P<url>download.*?RStudio-.*\.dmg)
    url: https://www.rstudio.com/products/rstudio/download/

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: https://%url%

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/downloads/RStudio.dmg/RStudio.app'
    requirement: identifier "org.rstudio.RStudio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FYF2F5GFX4
