Description: Downloads the latest version of the Krisp installer package and renames the package.
Identifier: com.github.jakeshotrosky.pkg.krisp
ParentRecipe: com.github.jakeshotrosky.download.krisp
MinimumVersion: 2.3.0

Input:
  NAME: Krisp
  VENDOR: Krisp
  SOFTWARETITLE: Krisp
  VERSIONTYPE: CFBundleShortVersionString

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/downloads/unpack'
    flat_pkg_path: '%pathname%'

- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/downloads/unpack/krisp-app.uli.pkg/scripts/Krisp*.pkg'

- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/downloads/payload'
    flat_pkg_path: '%found_filename%'

- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/downloads/payload/krisp*.pkg'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/downloads/payload/payload'
    pkg_payload_path: '%found_filename%/Payload'

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/downloads/payload/payload/Applications/krisp.app/Contents/Info.plist'
    plist_version_key: '%VERSIONTYPE%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/downloads/unpack'
    - '%RECIPE_CACHE_DIR%/downloads/payload'
